{
    "hadiths": [
        {
            "text": "إذا مات ابن آدم انقطع عمله إلا من ثلاث: صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له",
            "diacritics": "إِذَا مَاتَ ابنُ آدم انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثٍ: صَدَقَةٍ جَارِيَةٍ، أو عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ",
            "source": "صحيح الترمذي",
            "explanation": ""
        },
        {
            "text": "من صلى علي صلاة واحدة صلى الله عليه عشراً",
            "diacritics": "مَن صلى عَلَيَّ واحدةً ، صلى اللهُ عليه بها عَشْرًا",
            "source": "صحيح الجامع",
            "explanation": "قال رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم: «مَن صَلَّى عَلَيَّ صَلاةً واحِدةً صَلَّى اللهُ عَليهِ عَشْرَ صَلَواتٍ، وحُطَّت عنه عَشْرُ خَطيئاتٍ، ورُفِعَت له عَشْرُ دَرَجاتٍ»."
        },
        {
            "text": "كل أمتي يدخل الجنة إلا من أبى! قيل: ومن يأبى يا رسول الله؟! قال: من أطاعني دخل الجنة، ومن عصاني فقد أبى",
            "diacritics": "كُلُّ أُمَّتي يَدْخُلُونَ الجَنَّةَ إِلَّا مَن أَبَى، قالوا: يا رَسُولَ اللَّهِ، وَمَن يَأْبَى؟ قالَ: مَن أَطَاعَنِي دَخَلَ الجَنَّةَ، وَمَن عَصَانِي فقَدْ أَبَى.",
            "source": "صحيح البخاري",
            "explanation": ""
        },
        {
            "text": "المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدَر الله وما شاء فعل، فإن لو تفتح عمل الشيطان",
            "diacritics": "الْمُؤْمِنُ القَوِيُّ خَيْرٌ وَأَحَبُّ إلى اللهِ مِنَ المُؤْمِنِ الضَّعِيفِ، وفي كُلٍّ خَيْرٌ. احْرِصْ علَى ما يَنْفَعُكَ، وَاسْتَعِنْ باللَّهِ وَلَا تَعْجِزْ، وإنْ أَصَابَكَ شَيءٌ، فلا تَقُلْ: لو أَنِّي فَعَلْتُ كانَ كَذَا وَكَذَا، وَلَكِنْ قُلْ: قَدَرُ اللهِ وَما شَاءَ فَعَلَ؛ فإنَّ (لو) تَفْتَحُ عَمَلَ الشَّيْطَانِ.",
            "source": "صحيح مسلم",
            "explanation": ""
        },
        {
            "text": "إن لله تسعة وتسعين اسما مائة إلا واحدا، من أحصاها دخل الجنة",
            "diacritics": "إنَّ لِلَّهِ تِسْعَةً وتِسْعِينَ اسْمًا، مِائَةً إلَّا واحِدًا، مَن أحْصاها دَخَلَ الجَنَّةَ",
            "source": "صحيح البخاري",
            "explanation": ""
        },
        {
            "text": "لما قضى الله الخلق كتب في كتابه فهو عنده فوق العرش إن رحمتي سبقت غضبي",
            "diacritics": "لَمَّا قَضَى اللَّهُ الخَلْقَ، كَتَبَ عِنْدَهُ فَوْقَ عَرْشِهِ: إنَّ رَحْمَتي سَبَقَتْ غَضَبِي.",
            "source": "صحيح البخاري",
            "explanation": ""
        },
        {
            "text": "إن الله يغار وغيرة الله أن يأتي المؤمنُ ما حرم عليه",
            "diacritics": "إنَّ اللَّهَ يَغَارُ، وإنَّ المُؤْمِنَ يَغَارُ، وَغَيْرَةُ اللهِ أَنْ يَأْتِيَ المُؤْمِنُ ما حَرَّمَ عليه.",
            "source": "صحيح مسلم",
            "explanation": "يُخْبِرُ النبيُّ صلى الله عليه وسلم أنَّ الله يغار ويُبْغِضُ ويَكره، كما أن المؤمن يغار ويبغض ويكره، وأنَّ سببَ غيرةِ الله أنْ يأتيَ المؤمن ما حَرَّمَ الله عليه من الفواحش كالزنا واللواط والسرقة وشرب الخمر وغيرها من الفواحش."
        },
        {
            "text": "لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه",
            "diacritics": "لَا يُؤْمِنُ أحَدُكُمْ، حتَّى يُحِبَّ لأخِيهِ ما يُحِبُّ لِنَفْسِهِ.",
            "source": "صحيح البخاري",
            "explanation": ""
        },
        {
            "text": "خيركم من تعلم القرآن وعلمه",
            "diacritics": "خيرُكُم مَن تعلَّمَ القرآنَ وعلَّمَهُ",
            "source": "صحيح الترمذي",
            "explanation": ""
        },
        {
            "text": "",
            "diacritics": "اقْرَإِ القُرْآنَ في شَهْرٍ قُلتُ: إنِّي أجِدُ قُوَّةً حتَّى قالَ: فاقْرَأْهُ في سَبْعٍ ولا تَزِدْ علَى ذلكَ.",
            "source": "صحيح البخاري",
            "explanation": ""
        }
    ]
}
